Iteration3/app/controllers/polls_controller.rb

SELECT "polls".* FROM "polls"
---
  def index
    #@user=User.find_by_id(params[:id])
    #@polls = Pool.where(user_id: @user.id)
    @polls = Poll.all

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 4]]
---
  def edit
    @poll = Poll.find_by_id(params[:id])

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 4]]
---
   def update
    @poll = Poll.find_by_id(params[:id])

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 1]]
---
def destroy
  @poll = Poll.find_by_id(params[:id])
  if @poll.destroy

INSERT INTO "polls" ("topic", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["topic", "What is your name ?"], ["user_id", 12], ["created_at", "2017-04-14 22:40:33.763968"], ["updated_at", "2017-04-14 22:40:33.763968"]]
---
  def create
    @poll = Poll.new(poll_params)
    if @poll.save

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 6]]
SELECT "vote_options".* FROM "vote_options" WHERE "vote_options"."poll_id" = ?  [["poll_id", 18]]
---
  def show
    #@poll = Poll.find_by_id(params[:id])

    @poll = Poll.includes(:vote_options).find_by_id(params[:id])