trial/Iteration-2/Project-iter-1/app/controllers/polls_controller.rb

  def index
    #@user=User.find_by_id(params[:id])
    #@polls = Pool.where(user_id: @user.id)
    @polls = Poll.all
---
SELECT "polls".* FROM "polls"

  def edit
    @poll = Poll.find_by_id(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 4]]

   def update
    @poll = Poll.find_by_id(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 4]]

def destroy
  @poll = Poll.find_by_id(params[:id])
  if @poll.destroy
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 1]]

  def create
    @poll = Poll.new(poll_params)
    if @poll.save
---
INSERT INTO "polls" ("topic", "created_at", "updated_at") VALUES (?, ?, ?)  [["topic", "Richard"], ["created_at", "2017-04-13 21:40:43.679346"], ["updated_at", "2017-04-13 21:40:43.679346"]]

  def show
    @poll = Poll.find_by_id(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 6]]