trial/Iteration-2/Project-iter-1/app/controllers/votes_controller.rb

  def create
    if params[:poll] && params[:poll][:id] && params[:vote_option] && params[:vote_option][:id]
      @poll = Poll.find_by_id(params[:poll][:id])
      @option = @poll.vote_options.find_by_id(params[:vote_option][:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT 1  [["id", 14]]
SELECT  "vote_options".* FROM "vote_options" WHERE "vote_options"."poll_id" = ? AND "vote_options"."id" = ? LIMIT 1  [["poll_id", 14], ["id", 20]]