Iteration_4/app/controllers/polls_controller.rb

  def index
    #@user=User.find_by_id(params[:id])
    print("111111111111111111111111")
   # print(@participant.id)
    print("111111111111111111111111")
    @polls = Poll.where(user_id: params[:user_id])
---
SELECT "polls".* FROM "polls" WHERE "polls"."user_id" = ?  [["user_id", 3]]

  def index1

    @polls = Poll.where(user_id: params[:user_id])
---
SELECT "polls".* FROM "polls" WHERE "polls"."user_id" = ?  [["user_id", 4]]

  def edit
    @poll = Poll.find(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

   def richi
    print("say hello..................")
    @poll = Poll.find(params[:id])
    if @poll.update_attributes(poll_params)
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "polls" SET "topic" = ?, "updated_at" = ? WHERE "polls"."id" = ?  [["topic", "What is working ?"], ["updated_at", 2017-05-03 04:43:07 UTC], ["id", 18]]

def destroy
  @poll = Poll.find(params[:id])
  print(@poll.topic)
  if @poll.destroy
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "polls" WHERE "polls"."id" = ?  [["id", 2]]

  def create
    print("hell\n")
    print("hello\n")
    @poll = Poll.new(poll_params)
    @poll.user_id=params[:user_id]
    #@poll.vote_options.first.id=1
    #print("hell\n")
    #@poll.vote_options.first.poll_id=1
    print(@poll.vote_options.first.title)
    print("hello\n")
    print(@poll.vote_options.first.id)
    print("Hello\n")
    if @poll.save!
---
INSERT INTO "polls" ("topic", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["topic", "whta is your name "], ["created_at", 2017-04-22 18:10:34 UTC], ["updated_at", 2017-04-22 18:10:34 UTC], ["user_id", 1]]
INSERT INTO "vote_options" ("title", "poll_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hello"], ["poll_id", 4], ["created_at", 2017-04-22 18:10:34 UTC], ["updated_at", 2017-04-22 18:10:34 UTC]]

  def show
    #@poll = Poll.find_by_id(params[:id])

    @poll = Poll.includes(:vote_options).find_by_id(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "vote_options".* FROM "vote_options" WHERE "vote_options"."poll_id" = 1

  def set_poll
    @poll=Poll.find(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]